package com.web.parking.service.util

class ReplyMessageСonstant {

    companion object {
        const val CALLBACK_MENU = "\n" + "Что-бы вернуться в главное меню, нажмите кнопку ниже:"
        const val MESSAGE_START = "Для взаимодействия с ботом, нажмите: /start"
        const val GREETING : String = "" + "\n" + "Для регистрации в нашем сервисе, нажмите кнопку: Регистрация"
        const val REGISTRATION_GUIDE = "Пожалуйста, отправьте сообщение с регистрационным номером вашего автомобиля." + "\n" + "После отправки регистрация будет завершена"
        const val SUCCESSFUL = "Вы были успешно зарегистрированы!" + "\n" + "Теперь вы можете пользоваться нашим сервисом" + "\n" + "Что-бы вернуться в главное меню, нажмите кнопку ниже:"
        const val ALREADY_REGISTERED = "Пользовтель с данным номером авто уже зарегистрирован"
        const val FAIL = "Такого номера не существует, попробуйте еще раз"
        const val CHOOSE_AN_ACTON : String = "" + "\n" + "Выберите действие: " // тут нужно дать на выбор две кнопки, "Я подпер тачку" и "Помощь"
    }
}





